Repository: nimrod-cohen/wp-otp-login
Catalog: languages/wp-otp-login-*.po
Languages: he_il

source: Phone Number
he_il: מספר טלפון

source: Email Address
he_il: כתובת מייל

source: Email Address or mobile number
he_il: כתובת מייל או מספר סלולרי

source: email account and mobile number
he_il: תיבת המייל והטלפון שלך

source: Send my code
he_il: שלח לי קוד כניסה

source: Enter OTP code
he_il: הכנס את הקוד שקיבלת

source: Enter site
he_il: כניסה לאתר

source: Back
he_il: חזרה

source: Cannot find user
he_il: המשתמש לא נמצא

source: Incorrect code
he_il: קוד לא תקין

source: At this moment a one time code has been sent to your %s
he_il: ברגעים אלו נשלח אליך קוד חד פעמי ל%s

source: email account
he_il: תיבת המייל שלך

source: phone
he_il: טלפון

source: Please wait %s seconds before resubmitting
he_il: ניתן לבצע נסיון נוסף בעוד %s שניות

source: I received the code
he_il: קיבלתי את הקוד

source: Could not find user by this identifier
he_il: לא נמצא משתמש עם מזהה כזה

source: Please wait while you are being redirected
he_il: אנא המתן בזמן שאנחנו מעבירים אותך לאתר
